app/controllers/books_controller.rb

INSERT INTO "books" ("title", "content", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sđsd"], ["content", ""], ["author", ""], ["created_at", "2018-01-14 17:23:59.449183"], ["updated_at", "2018-01-14 17:23:59.449183"]]
---
    def create
        @book = Book.new(book_params)
            if @book.save