app/controllers/employees_controller.rb

  def index
    @employees = Employee.all
---
SELECT `employees`.* FROM `employees`

  def show
    @employee = Employee.find_by id: params[:id]
---
SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1

  def edit
    @employee = Employee.find_by id: params[:id]
---
SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1

  def create

      em = Employee.new(employee_params)
      if em.save
---
INSERT INTO `employees` (`name`, `email`, `created_at`, `updated_at`, `password`, `password_confirm`) VALUES ('ds', 'sd@gmail.com', '2018-03-11 14:29:15', '2018-03-11 14:29:15', 'aaa', 'aaaaaa')

  def update
      @employee = Employee.find_by id: params[:id]
---
SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1

  def set_employee
     @employee = Employee.find_by id:params[:id]
---
SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` IS NULL LIMIT 1